Revit 2026 API

# AnalyticalBusData Properties

---

The AnalyticalBusData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssignedPhasesNumber | The number of electrical phases assigned through the distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData) |
|  | AssignedVoltage | The voltage assigned through the distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData) |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. (Inherited from AnalyticalDistributionNodePropertyData) |
|  | CurrentRating | The current rating value of the analytical bus. |
|  | DistributionSystem | The distribution system of the power distributable node. (Inherited from AnalyticalPowerDistributableNodeData) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AnalyticalDistributionNodePropertyData) |
|  | TotalConnectedCurrent | The total connected current of the analytical bus. |

#### Reference

AnalyticalBusData Class

Autodesk.Revit.DB.Electrical Namespace